[
    [
        "(Шиваров Александр) Задача 1.\nПусть в стране Т. умеют производить всего два товара - X и Y, а КПВ линейна. Обозначим альтернативные издержки производства х и y как OCx и OCy соответственно. Известно, что в любой точке на КПВ OCx+OCy=2,5 (если забыть про то, что они разной размерности). Найдите ОСx, если максимальное количество Х меньше максимального количества Y. В ответ запишите только число.",
        "2"
    ],
    [
        "(Шиваров Александр) Задача 2\nСтрана Р. состоит из двух регионов, пусть КПВ регионов это y+2x=2 и 2y+x=2 соответственно. Предположим, что страна Р. торгует со страной Б., которая имеет КПВ x+y=1. Будем считать, что страна Р. имеет монопольную власть над страной Б и сама назначает цены (но если стране Б невыгодно торговать, то она не торгует). Найдите КТВ страны Р. (в ответ запишите площадь под КТВ)",
        "7.5"
    ],
    [
        "(Шиваров Александр) Задача 3.\nРоссия экспортирует товар только в четыре страны: Казахстан, Беларусь, Монголию и Татарстан. Казахстан и Беларусь экспортируют товары только в Китай, а Монголия и Татарстан только в Америку. Китай и Америка, в свою очередь, экспортируют товар только в Россию. Найдите величину импорта Татарстана, если известно, что торговый баланс всех стран равен нулю, а экспорт России - 100, Китая - 75, Беларуси – 40, а Монголии – 10.\n(Татарстан - пока не страна, мы понимаем)",
        "15"
    ],
    [
        "(Остроброд Игорь) Задача 4.\nВ Океании живет три группы населения: мыслепреступники, партийцы и наблюдатели. Доходы в группах распределены равномерно, один мыслепреступник не богаче партийца, а один партиец имеет доход в два раза меньший, чем у одного наблюдателя. Также известно, что доход либо наблюдателей, либо мыслепреступников в два раза больше, чем доход каждой из двух других групп и никакие две группы не равны по численности.\nВ один прекрасный день Большой Брат был свергнут, и новый правитель решил уравнять доходы. Он взял подоходный налог t (t < 1) с самых богатых и все распределил равномерно между мыслепреступниками. Через неделю он понял, что у него ничего не получилось, и теперь он взял налог s (s < 1) с самых богатых (если таких групп две, то он выбирает наугад) и оипять отдал s бедным. После этого в Океании наступило абсолютное равенство доходов (коэффициент Джини равен 0). Чему равны числа t и s, если изначально в стране коэффициент Джини был равен 9/40? (в ответ запишите сумму s+t)",
        "0.8"
    ],
    [
        "(Шиваров Александр) Задача 5.\nВ стране Р. проживает 148 человек. Как-то в этой стране Серёжа решил организовать финансовую пирамиду, обещая каждому участнику выплатить некоторую сумму S, взамен того, что сейчас они заплатят некоторую сумму m.\nБудем считать, что каждый следующий человек оценивает свою вероятность получения заветной суммы как количество людей, не участвующих в пирамиде, деленное на всё население страны, и ведёт себя рационально (считает матожидание), но если ему безразлично - участвует.\nНайдите, какое количество людей будет участвовать в пирамиде, если Серёжа хочет получить как можно большее количество денег, а выполнять обязательства ни перед кем не собирается.\n(считаем, что каждый в каждый момент времени к пирамиде присоединяйтся только один человек, то есть решения вступить или не вступить в пирамиду они принимают поочерёдно)",
        "74"
    ],
    [
        "(Шиваров Александр) Задача 6.\nПредставим рынок, на котором монополист в каждом следующем периоде выбирает цену методом \"проб и ошибок\", ибо ничего не знает про функцию спроса. А спрос не меняется из периода в период.\nТак, если в текущем периоде прибыль оказалась меньше прибыли в предыдущем периоде, то он возвращается к цене предыдущего периода и больше ничего не меняет. Если же прибыль оказалась больше, то изменяет цену до цены равной средней за два предыдущих периода.\nНайдите оптимальную цену монополиста, если известно, что каждый следующий период его прибыль увеличивалась, а в первом периоде цена равнялась 90.\n(считать, что в нулевом периоде цена равнялась нулю, ибо монополиста не было на рынке)",
        "60"
    ],
    [
        "(Шиваров Александр) Задача 7.\nКак-то на ФОПФе случился КОЛЛАПС, и Юрец потерял все деньги. Поэтому он решил заработать, введя налог (потому что связи) на местном совершенно-конкурентном рынке. К сожалению, Юрец ничего не знает про рынок, кроме того, что предложение и спрос на нём линейны, а что-то из них всегда эластично по цене. Так что он обратился к своему другу, который смог дать ему следующую информацию:\nЕсли Юрец введет налог t<=100, то DWL на рынке составит t^2, но если t>100, то Юрец ничего не получит. (DWL – t в квадрате)\nНайдите максимальную сумму налога, который сможет собрать Юрец.",
        "5000"
    ],
    [
        "(Шиваров Александр) Задача 8.\nНа рынке действует фирма, максимизирующая прибыль, издержки которой выражены как TC=Q^2+2Q+5. Аналитики фирмы заметили, что в оптимуме эластичность общих издержек по предельным издержкам равна по абсолютной величине единице. Найдите оптимальный выпуск фирмы. (Издержки – Q в квадрате плюс два Q плюс 5)",
        "1"
    ],
    [
        "(Шиваров Александр) Задача 9.\nВ некоторой ПРОСТОЙ экономике совокупный спрос определятся количественной теорией денег, а агрегированная производственная функция страны задаётся как AF=KL, где L - совокупное количество людей занятых в производстве, а K - совокупное количество капитала, используемое экономикой. (K, L - только целые).\nКак-то, читая новости, программист Саша увидел статью с заголовком: \"2 БАЗОВЫХ факта, которые перевернут Вашу жизнь\", Саша, конечно же повёлся и узнал, что в экономике его страны максимально возможное количество труда стабильно и равняется 136, а капитала - 85 (так же стабильно во времени).\nК сожалению, Саша-программист не понял прикола и пошёл к Саше-экономисту, который ему сразу сказал: \"Если бы ты знал, что в экономике естественный уровень безработицы равен 25%, а уровень цен в долгосрочном равновесии равен 1, то смог бы найти денежную БАЗУ\".\nОкончательно запутавшись, Саша-программист начал читать все статьи с подобными заголовками и узнал, что банковский мультипликатор равен скорости обращения денег и оба равны целому числу, а норма обязательных резервов не равна 100%, и денежная база - тоже целое число. \"ОХ КАК!\", сказал Саня, окончательно запутавшись, и забил на несмешные приколы.\nНайдите денежную базу, если все вышеприведенные факты верны. (+в экономике нет наличных, банки не хранят избыточные резервы, денежная база и скорость обращения денег стабильны во времени)",
        "30"
    ],
    [
        "(Шиваров Александр) Задача 10.\nВ стране Р. умеют производить лишь нефть и газ, а КПВ страны выглядит как 𝑋 + 𝑌 = 10, где 𝑋 - нефть в литрах, а 𝑌 - газ в кубометрах. Не так давно страна Р. объединилась со страной Б., которая не умеет производить нефть и газ, зато умеет перерабатывать один литр нефти в два кубометра газа или же перерабатывать кубометр газа в два литра нефти.\nПредположим, что страна Б. может суммарно переработать не больше 20 литров нефти и 20 кубометров газа, постройте КПВ объединенной страны.\n(перерабатывать нефть и газ можно бесконечное число раз, то есть из переработанной нефти можно снова сделать газ)\nВ ответ запишите площадь под КПВ.",
        "1050"
    ],
    [
        "(Шиваров Александр) Задача 11.\nНа рынке работает монополист, спрос на продукцию которого задаётся функцией Q=90-P, а MC=Q. Предположим, деятельность монополиста приносит отрицательный внешний эффект, который для i-ого жителя страны можно можно выразить как TC=Q^2/(2^(i+1)), где i>0 и является целым (ибо не все жители ощущают его одинаково). Будем считать, что число жителей в стране стремится к бесконечности. Найдите общественные DWL (издержки мертвого груза для общества в целом) от деятельности монополиста, если он выбирает объём выпуска, игнорируя внешний эффект.\n(Издержки – Q в квадрате делить на 2 в степени i+1),\n (каждый житель страны несёт издержки, независимо от того, потребляет ли он продукт)",
        "0"
    ],
    [
        "(Остроброд Игорь) Задача 12.\nВ двумерной вселенной планета Гекса имеет форму правильного шестиугольника со стороной 9. Над каждой вершиной, перпендикулярно стороне, которая от этой вершины расположена по часовой стрелке (см рис.), висит по одной космической станции на высоте 2sqrt(3) (два корня из трёх). Компания Y-Atmosphere решила запустить кругостанционное путешествие. Оно начинается в станции 1, проходит через все станции по часовой стрелке и заканчивается в первой же станции (доставляет людей с планеты на станцию и забирает их оттуда другая компания). Однако аналитики выяснили, что для перелёта на соседнюю станцию придется все-таки приземлиться на кусок земли между вершинами, над которыми висят станции, чтобы пополнить запасы еды, топлива и т.п. Издержки на топливо линейно зависимы от расстояния, а других издержек фирма не несёт. Компания Y-Atmosphere минимизирует издержки. На каком расстоянии от левой вершины ей надо построить космодром на каждой стороне шестиугольника?",
        "8"
    ]
]